<template>
	<div class="Home">
		<header class="masthead">
      <b-container class="intro-text">
        <b-row align-v="center" align-h="center" class="intro-text-container text-center">
          <b-col col>
            <p class="intro-lead-in">Удружење слободног просвећеног народа.</p>
            <p class="intro-main">УСПОН</p>
          </b-col>
        </b-row>
      </b-container>
    </header>
    <section class="content">
      <section class="about">
        Удружење УСПОН је удружење које се бави уздизањем свести о културолошком наслеђу света,
        едукацијом првенствено младих, истраживачким радом и спортским активностима.
        Основали смо се са намером да људима пружимо нов и универзалан поглед на свет,
        поглед онога којег данас називамо ренесансним човеком. Организовани смо у 10 тимова:<br/><br/>
        <ul>
          <li>
            Књижевни: за собом има књижевно вече "Велике љубави великих писаца" и квиз о познавању књижевности који
            су били на НОФЕК-у (СПЕНС) и били су хуманитерног карактера, књижевно вече "Вече Сергеја јесењина" 
            (Градска библиотека) пред његов рођендан које је чак и поновљено због велике заинтересованости,
            књижевно вече "Поезија на дар" (Гимн. "Јован Јовановић Змај") и књижевно вече "Бохемија" (Гимн. "Ј. Ј. Змај")
          </li>
          <li>
            Музички: концерт "Романтизам у Европи" (КЦНС), "Вече руске музике" (Руски центар) и 
            журка у студиу Фирчи која је била хуманитарног карактера
          </li>
          <li>
            Социолошки: тренутно спроводи анкету "Медији и млади"
          </li>
          <li>

          </li>
          <li>
            Ликовни: радионица "Вековна компарација" (Инфополис), радионица "Претстављене и стварно велике четкице" 
            (Инфополис) и сада је у организацији изложба Ларе Петковић, наше истакнуте чланице</li>
          <li>
            Драмски: тренутно су у току пробе за претставу "Када Бог зажмури" по истоименој књизи ауторке Марије Васић
          </li>
          <li>
            Научни: конференција "Одело савременог научника" (Гимн. "Ј. Ј. Змај")
          </li>
          <li>
            Математички: бесплатна школа из математике за децу којој је помоћ из математике потребна (Инфополис) 
            то је стално у току те се људи увек могу пријавити, у плану је припрема за пријемни за средње школе и 
            факултете из математике
          </li>
          <li>
            Историјски: у плану је серија предавања о знаменитим личностима Новог Сада (Градска библиотека)
          </li>
          <li>
            Спортски: успостављена је сарадња са Пролетером и радимо на хуманитарним утакмицама
          </li>
           <li>
             Технолошки: пружа техничку подршку Удружењу у виду одржавања странице, а у плану је и бесплатна 
             програмерска школа
           </li>
        </ul><br/>
        
        Трудимо се да успемо у својим нескромно речено племенитим циљевима како би активирали људе који су 
        чак и заборавили колико је тако нешто важно.<br/><br/><br/>

        Срдачан поздрав,
        Лука З. Станковић
      </section>
    </section>
	</div>
</template>

<script>
export default {
  name: "Home"
};
</script>

<style>
.Home {
  width: 700px;
  margin-left: calc((100% - 700px)/2);
}
.masthead {
  height: calc(100vh - 106px);
}
.masthead .intro-text {
  height: 100%;
}
.masthead .intro-text .intro-text-container {
  height: 100%;
}
.intro-lead-in {
  font-size: 1.1em;
}
.intro-main {
  font-size: 6em;
}
.about {
  font-size: 1.1em;
}

@media screen and (max-width: 767px) {
  .Home {
    width: 100%;
    margin-left: 0;
  }
  /*.masthead .intro-text {
    margin-top: 50%;
  }*/
  .masthead .intro-text .intro-main {
    font-size: 4.5em;
  }
  .content {
    width: 90%;
    margin-left: calc((100% - 90%)/2);
  }
  .about {
    font-size: 1em;
  }
}
</style>
